# определить индексы элементов массива (списка), значения которых принадлежат
# заданному диапазону(т.е. не меньше заданного минимума и не больше заданного 
# минимума и не больше заданного максимума )

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

# from random import randint

# list1 = []
# for i in range(10):
#     list1.append(randint(-10, 10))
# print(list1)

list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
list_2 = []
min = int(input('Задайте нижний предел: '))
max = int(input('Задайте верхний предел: '))

for i in range(len(list1)):
    if min <=list1[i] <= max:
        print(i, end = " ")